rtucker85/nuttx/arch/arm/src/s32k3xx/s32k3xx_clockconfig_orig.c
/****************************************************************************
 * arch/arm/src/s32k3xx/s32k3xx_clockconfig.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <assert.h>
#include <debug.h>

#include <nuttx/arch.h>

#include "arm_internal.h"

#include "hardware/s32k3xx_mc_me.h"
#include "hardware/s32k3xx_mc_cgm.h"
#include "hardware/s32k3xx_firc.h"
#include "hardware/s32k3xx_sirc.h"
#include "hardware/s32k3xx_fxosc.h"
#include "hardware/s32k3xx_sxosc.h"
#include "hardware/s32k3xx_pll.h"
#include "s32k3xx_pin.h"
#include "hardware/s32k344_pinmux.h"
#include "s32k3xx_periphclocks.h"
#include "s32k3xx_clockconfig.h"

#include <arch/board/board.h>  /* Include last.  May have dependencies */

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k3xx_get_scs_clk_source
 *
 * Description:
 *   Gets SCS current system clock source
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   1 equals PHI1 0 equals FIRC
 *
 ****************************************************************************/

static inline uint32_t s32k3xx_get_scs_clk_source(void)
{
  return ((getreg32(S32K3XX_MC_CGM_MUX_0_CSC)
           & MC_CGM_MUX_0_CSC_SELCTL_MASK) ==
           MC_CGM_MUX_CSC_SELCTL_PLL_PHI0_CLK);
}

/****************************************************************************
 * Name: s32k3xx_get_fxoscfreq
 *
 * Description:
 *   Gets FXOSC clock frequency (FXOSC).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The FXOSC frequency.  Zero is returned if the FXOSC is not stable.
 *
 ****************************************************************************/

static uint32_t s32k3xx_get_fxoscfreq(void)
{
  /* Check if the FXOSC is stable */

  if ((getreg32(S32K3XX_FXOSC_STAT) & FXOSC_STAT_OSC_STAT_ON) != 0)
    {
      return BOARD_XTAL_FREQUENCY;
    }
  else
    {
      return 0;
    }
}

/****************************************************************************
 * Name: s32k3xx_get_sircfreq
 *
 * Description:
 *   Gets Slow IRC clock frequency (SIRC).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The SIRC frequency.  Zero is returned if the SIRC is invalid.
 *
 ****************************************************************************/

static uint32_t s32k3xx_get_sircfreq(void)
{
  /* Check if the SIRC is valid */

  if ((getreg32(S32K3XX_SIRC_SR) & SIRC_SR_STATUS_ON) != 0)
    {
      return CGM_SIRC_FREQUENCY0;
    }

  return 0;
}

/****************************************************************************
 * Name: s32k3xx_get_fircfreq
 *
 * Description:
 *   Gets Fast IRC clock frequency (FIRC).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The FIRC frequency.  Zero is returned if the FIRC is invalid.
 *
 ****************************************************************************/

static uint32_t s32k3xx_get_fircfreq(void)
{
  /* Check if the FIRC is valid */

  if ((getreg32(S32K3XX_FIRC_STATUS) & FIRC_STATUS_ON) != 0)
    {
      /* TODO check HSE FIRC DIV register */

      return CGM_FIRC_HIGHRANGE_FREQUENCY;
    }
  else
    {
      return 0;
    }
}

/****************************************************************************
 * Name: s32k3xx_get_pllfreq
 *
 * Description:
 *   Gets PLL clock frequency (SPLL).
 *
 * Input Parameters:
 *   uint32_t id
 *
 * Returned Value:
 *   The PLL frequency.  Zero is returned if the PLL is invalid.
 *
 ****************************************************************************/

static uint32_t s32k3xx_get_pllfreq(void)
{
  uint32_t freq;
  uint32_t regval;
  uint32_t prediv;
  uint32_t postdiv;
  uint32_t mult;

  /* Check if the PLL is valid */

  if ((getreg32(S32K3XX_PLL_SR) & PLL_SR_LOCK) != 0)
    {
      /* Get System Oscillator frequency. */

      freq = s32k3xx_get_fxoscfreq();
      if (freq != 0)
        {
          regval = getreg32(S32K3XX_PLL_DV);
          prediv = ((regval & PLL_DV_RDIV_MASK) >>
                     PLL_DV_RDIV_SHIFT);
          if (prediv == 0)
            {
              prediv = 1;
            }

          mult   = ((regval & PLL_DV_MFI_MASK) >>
                     PLL_DV_MFI_SHIFT);
          postdiv = ((regval & PLL_DV_ODIV2_MASK) >>
                     PLL_DV_ODIV2_SHIFT);
          if (postdiv == 0)
            {
              postdiv = 1;
            }

          freq  /= prediv;
          freq  *= mult;
          freq  /= postdiv;
        }

      return freq;
    }
  else
    {
      return 0;
    }
}

static uint32_t s32k3xx_get_phi0freq(void)
{
  uint32_t regval;
  uint32_t div;

  regval = getreg32(S32K3XX_PLL_ODIV0);

  div = ((regval & PLL_ODIV_DIV_MASK) >> PLL_ODIV_DIV_SHIFT);

