rtucker85/nuttx/arch/arm/src/s32k3xx/s32k3xx_clockconfig_orig.c
  if (div == 0)
    {
      return 0;
    }
  else
    {
      return s32k3xx_get_pllfreq() / (div + 1);
    }
}

/****************************************************************************
 * Name: s32k3xx_get_scsfreq
 *
 * Description:
 *   Gets SCS current system clock frequence
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   1 equals PHI1 0 equals FIRC
 *
 ****************************************************************************/

static inline uint32_t s32k3xx_get_scsfreq(void)
{
  if (s32k3xx_get_scs_clk_source())
    {
      return s32k3xx_get_phi0freq();
    }
  else
    {
      return s32k3xx_get_fxoscfreq();
    }
}

static uint32_t s32k3xx_mux_0_clocktransition(void)
{
  /* Clock transition */

  uint32_t timeout = 1000;
  uint32_t regval;

  putreg32(1, S32K3XX_MC_CGM_MUX_0_DIV_TRIG);

  do
    {
      timeout--;
    }
  while ((getreg32(S32K3XX_MC_CGM_MUX_0_DIV_UPD_STAT)
         & MC_CGM_MUX_DIV_UPD_STAT_DIV_STAT) != 0 && timeout > 0);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }

  timeout = 1000;

  do
    {
      timeout--;
    }
  while ((getreg32(S32K3XX_MC_CGM_MUX_0_CSS)
         & MC_CGM_MUX_CSS_SWIP) != 0 && timeout > 0);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }

  regval = getreg32(S32K3XX_MC_CGM_MUX_0_CSC);
  regval |= MC_CGM_MUX_CSC_CLK_SW;
  putreg32(regval, S32K3XX_MC_CGM_MUX_0_CSC);

  timeout = 1000;

  do
    {
      timeout--;
    }
  while ((getreg32(S32K3XX_MC_CGM_MUX_0_CSS)
         & MC_CGM_MUX_CSS_CLK_SW) == 0 && timeout > 0);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }
  else
    {
      return 0;
    }
}

static uint32_t s32k3xx_mux_x_clocktransition(uint32_t mux_csc_base)
{
  /* Clock transition */

  uint32_t timeout = 1000;
  uint32_t regval;

  do
    {
      timeout--;
    }
  while ((getreg32(mux_csc_base + S32K3XX_MC_CGM_MUX_X_DIV_UPD_STAT_OFFSET)
         & MC_CGM_MUX_DIV_UPD_STAT_DIV_STAT) != 0 && timeout > 0);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }

  timeout = 1000;

  do
    {
      timeout--;
    }
  while ((getreg32(mux_csc_base + S32K3XX_MC_CGM_MUX_X_CSS_OFFSET)
         & MC_CGM_MUX_CSS_SWIP) != 0 && timeout > 0);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }

  regval = getreg32(mux_csc_base + S32K3XX_MC_CGM_MUX_X_CSC_OFFSET);
  regval |= MC_CGM_MUX_CSC_CLK_SW;
  putreg32(regval, mux_csc_base + S32K3XX_MC_CGM_MUX_X_CSC_OFFSET);

  timeout = 1000;

  do
    {
      timeout--;
    }
  while ((getreg32(mux_csc_base + S32K3XX_MC_CGM_MUX_X_CSS_OFFSET)
         & MC_CGM_MUX_CSS_CLK_SW) == 0 && timeout > 0);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }
  else
    {
      return 0;
    }
}

static int s32k3xx_fxosc_peripheral(bool enable)
{
  uint32_t regval;
  uint32_t timeout;

  /* Check if clock is running */

  regval  = getreg32(S32K3XX_MC_ME_PRTN1_COFB1_STAT);

  if ((regval & MC_ME_PRTN1_COFB1_STAT_FXOSC) == 0)
    {
      /* Enable FXOSC pheripheral clock */

      regval  = getreg32(S32K3XX_MC_ME_PRTN1_COFB1_CLKEN);

      if (enable)
        {
          regval |= MC_ME_PRTN1_COFB1_CLKEN_FXOSC;
        }
      else
        {
          regval &= ~MC_ME_PRTN1_COFB1_CLKEN_FXOSC;
        }

      putreg32(regval, S32K3XX_MC_ME_PRTN1_COFB1_CLKEN);

      /* Partition clock enable */

      regval = MC_ME_PRTN_PCONF_PCE;
      putreg32(regval, S32K3XX_MC_ME_PRTN1_PCONF);

      /* Update PRTN1 using Process update register */

      regval = MC_ME_PRTN_PUPD_PCUD;
      putreg32(regval, S32K3XX_MC_ME_PRTN1_PUPD);

      /* Control key register */

      putreg32(MC_ME_CTL_KEY(0x5af0), S32K3XX_MC_ME_CTL_KEY);
      putreg32(MC_ME_CTL_KEY(~0x5af0), S32K3XX_MC_ME_CTL_KEY);

      timeout = 1000;

      do
        {
          timeout--;
        }
      while ((getreg32(S32K3XX_MC_ME_PRTN1_COFB1_STAT)
          & MC_ME_PRTN1_COFB1_STAT_FXOSC) == !enable);

      if (timeout == 0)
        {
          return -ETIMEDOUT;
        }
      else
        {
          return 0;
        }
    }

  else
    {
      return 0;
    }
}

static int s32k3xx_mscm_peripheral(bool enable)
{
  uint32_t regval;
  uint32_t timeout;

  /* Check if clock is running */

  regval  = getreg32(S32K3XX_MC_ME_PRTN1_COFB0_STAT);

  if ((regval & MC_ME_PRTN1_COFB0_STAT_MSCM) == 0)
    {
      /* Enable MSCM pheripheral clock */

      regval  = getreg32(S32K3XX_MC_ME_PRTN1_COFB0_CLKEN);
      if (enable)
        {
          regval |= MC_ME_PRTN1_COFB0_CLKEN_MSCM;
        }
      else
        {
          regval &= ~MC_ME_PRTN1_COFB0_CLKEN_MSCM;
        }

      putreg32(regval, S32K3XX_MC_ME_PRTN1_COFB0_CLKEN);

      /* Partition clock enable */

      putreg32(MC_ME_PRTN_PCONF_PCE, S32K3XX_MC_ME_PRTN1_PCONF);

      /* Update PRTN1 using Process update register */

      putreg32(MC_ME_PRTN_PUPD_PCUD, S32K3XX_MC_ME_PRTN1_PUPD);

      /* Control key register */

      putreg32(MC_ME_CTL_KEY(0x5af0), S32K3XX_MC_ME_CTL_KEY);
      putreg32(MC_ME_CTL_KEY(~0x5af0), S32K3XX_MC_ME_CTL_KEY);

      timeout = 1000;

      do
        {
          timeout--;
        }
      while ((getreg32(S32K3XX_MC_ME_PRTN1_COFB0_STAT)
              & MC_ME_PRTN1_COFB0_STAT_MSCM) == !enable && timeout > 0);

      if (timeout == 0)
        {
          return -ETIMEDOUT;
        }
      else
        {
          return 0;
        }
    }

  return 0;
}

static int s32k3xx_pll_peripheral(bool enable)
{
  uint32_t regval;
  uint32_t timeout;

  /* Check if clock is running */

  regval  = getreg32(S32K3XX_MC_ME_PRTN1_COFB1_STAT);

  if ((regval & MC_ME_PRTN1_COFB1_STAT_PLL) == 0)
    {
      /* Enable FXOSC peripheral clock */

      regval  = getreg32(S32K3XX_MC_ME_PRTN1_COFB1_CLKEN);
      if (enable)
        {
          regval |= MC_ME_PRTN1_COFB1_CLKEN_PLL;
        }
      else
        {
          regval &= ~MC_ME_PRTN1_COFB1_CLKEN_PLL;
        }

      putreg32(regval, S32K3XX_MC_ME_PRTN1_COFB1_CLKEN);

      /* Partition clock enable */

      putreg32(MC_ME_PRTN_PCONF_PCE, S32K3XX_MC_ME_PRTN1_PCONF);

      /* Update PRTN1 using Process update register */

      putreg32(MC_ME_PRTN_PUPD_PCUD, S32K3XX_MC_ME_PRTN1_PUPD);

      /* Control key register */

      putreg32(MC_ME_CTL_KEY(0x5af0), S32K3XX_MC_ME_CTL_KEY);
      putreg32(MC_ME_CTL_KEY(~0x5af0), S32K3XX_MC_ME_CTL_KEY);

