rtucker85/nuttx/arch/arm/src/s32k3xx/s32k3xx_clockconfig_orig.c
      timeout = 1000;

      do
        {
          timeout--;
        }
      while ((getreg32(S32K3XX_MC_ME_PRTN1_COFB1_STAT)
              & MC_ME_PRTN1_COFB1_STAT_PLL) == !enable && timeout > 0);

      if (timeout == 0)
        {
          return -ETIMEDOUT;
        }
      else
        {
          return 0;
        }
    }

  return 0;
}

/****************************************************************************
 * Name: s32k3xx_pll_config
 *
 * Description:
 *   Configure PLL clocking.
 *
 * Input Parameters:
 *   pllcfg - Describes the new PLL clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k3xx_pll_config(const struct cgm_pll_config_s *pllcfg)
{
  uint32_t regval;
  int32_t retval;
  uint32_t timeout;
  uint32_t freq;

  /* Enable FXOSC peripheral */

  retval = s32k3xx_fxosc_peripheral(true);

  if (retval < 0)
    {
      return retval;
    }

  /* Enable FXOSC for XTAL */

  regval = (FXOSC_CTRL_COMP_EN | FXOSC_CTRL_EOCV(157) |
              FXOSC_CTRL_GM_SEL_0X | FXOSC_CTRL_OSCON | FXOSC_CTRL_OSC_BYP);

  putreg32(regval, S32K3XX_FXOSC_CTRL);

  do {
    freq = s32k3xx_get_fxoscfreq();
  } while(freq == 0);

  up_udelay(1000);

  /* Enable PLL peripheral */

  retval = s32k3xx_pll_peripheral(true);

  up_udelay(1000);

  if (retval < 0)
    {
      return retval;
    }

  /* Setup PLL Divider */

  regval = (PLL_DV_RDIV_DIV(pllcfg->prediv) | PLL_DV_MFI(pllcfg->mult) |
            PLL_DV_ODIV2_DIV(pllcfg->postdiv));

  putreg32(regval, S32K3XX_PLL_DV);
  up_udelay(1000);

  /* Setup PLL Fractional Divider */

  regval = getreg32(S32K3XX_PLL_FD);

  regval &= ~(PLL_FD_SDMEN | PLL_FD_SDM2);

  putreg32(regval, S32K3XX_PLL_FD);
  up_udelay(1000);

  /* Setup PLL Frequency Modulation */

  regval = getreg32(S32K3XX_PLL_FM);

  regval &= ~(PLL_FM_STEPSIZE_MASK | PLL_FM_SPREADCTL |
              PLL_FM_STEPNO_MASK);

  regval |= PLL_FM_SSCGBYP | PLL_FM_SPREADCTL;

  putreg32(regval, S32K3XX_PLL_FM);
  up_udelay(1000);

  /* Set PLL_PHI0 divider */

  if (pllcfg->phi0 == CGM_PLL_PHI_DIV_DISABLE)
    {
      putreg32(0, S32K3XX_PLL_ODIV0);
    }
  else
    {
      putreg32((PLL_ODIV_DIV(pllcfg->phi0)
               | PLL_ODIV_DE), S32K3XX_PLL_ODIV0);
    }
    up_udelay(1000);

  /* Set PLL_PHI1 divider */

  if (pllcfg->phi1 == CGM_PLL_PHI_DIV_DISABLE)
    {
      putreg32(0, S32K3XX_PLL_ODIV1);
    }
  else
    {
      putreg32((PLL_ODIV_DIV(pllcfg->phi1)
               | PLL_ODIV_DE), S32K3XX_PLL_ODIV1);
    }
    up_udelay(1000);

  /* enable PLL */

  putreg32(0, S32K3XX_PLL_CR);

  timeout = 1000;

  do
    {
      timeout--;
    }
  while ((getreg32(S32K3XX_PLL_SR)
         & PLL_SR_LOCK) == 0);
         up_udelay(1000);

  if (timeout == 0)
    {
      return -ETIMEDOUT;
    }
  else
    {
      return 0;
    }
}

/****************************************************************************
 * Name: s32k3xx_scs_config
 *
 * Description:
 *   Configure SCS clocking.
 *
 * Input Parameters:
 *   scscfg - Describes the new SCS clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k3xx_scs_config(const struct cgm_scs_config_s *scscfg)
{
  if (scscfg->scs_source == CGM_SCS_SOURCE_FIRC)
    {
      putreg32(MC_CGM_MUX_CSC_SELCTL_FIRC
               | MC_CGM_MUX_CSC_CLK_SW,
               S32K3XX_MC_CGM_MUX_0_CSC);
    }
  else if (scscfg->scs_source == CGM_SCS_SOURCE_PLL_PHI0)
    {
      putreg32(MC_CGM_MUX_CSC_SELCTL_PLL_PHI0_CLK
               | MC_CGM_MUX_CSC_CLK_SW,
               S32K3XX_MC_CGM_MUX_0_CSC);
    }

  if (scscfg->core_clk.div != CGM_MUX_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->core_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_0);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_0);
    }

  if (scscfg->aips_plat_clk.div != CGM_MUX_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->aips_plat_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_1);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_1);
    }

  if (scscfg->aips_slow_clk.div != CGM_MUX_SLOW_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->aips_slow_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_2);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_2);
    }

  if (scscfg->hse_clk.div != CGM_MUX_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->hse_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_3);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_3);
    }

  if (scscfg->dcm_clk.div != CGM_MUX_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->dcm_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_4);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_4);
    }

  if (scscfg->lbist_clk.div != CGM_MUX_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->lbist_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_5);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_5);
    }

#ifdef CONFIG_S32K3XX_QSPI
  if (scscfg->qspi_mem_clk.div != CGM_MUX_DISABLE)
    {
      putreg32((MC_CGM_MUX_DC_DE
               | MC_CGM_MUX_DC_DIV(scscfg->qspi_mem_clk.div)),
               S32K3XX_MC_CGM_MUX_0_DC_6);
    }
  else
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_0_DC_6);
    }
#endif

  if (scscfg->mux_1_stm0.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_1_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_1_stm0.source
               << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_1_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_1_stm0.div)
               | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_1_DC_0);
    }

  if (scscfg->mux_3.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_3_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_3.source
               << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_3_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_3.div)
               | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_3_DC_0);
    }

  if (scscfg->mux_4.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_4_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_4.source
                << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_4_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_4.div)
               | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_4_DC_0);
    }

#ifdef CONFIG_S32K3XX_ENET
  if (scscfg->mux_7_emac_rx.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_7_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_7_emac_rx.source
               << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_7_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_7_emac_rx.div)
               | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_7_DC_0);
    }

  if (scscfg->mux_8_emac_tx.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_8_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_8_emac_tx.source
               << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_8_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_8_emac_tx.div)
               | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_8_DC_0);
    }

