rtucker85/nuttx/arch/arm/src/s32k3xx/s32k3xx_clockconfig_orig.c
  if (scscfg->mux_9_emac_ts.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_9_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_9_emac_ts.source
               << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_9_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_9_emac_ts.div)
               | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_9_DC_0);
    }
#endif

#ifdef CONFIG_S32K3XX_QSPI
  if (scscfg->mux_10_qspi_sfck.div == CGM_MUX_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_10_DC_0);
    }
  else
    {
      putreg32((scscfg->mux_10_qspi_sfck.source
               << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_10_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(scscfg->mux_10_qspi_sfck.div)
                | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_10_DC_0);
    }
#endif

  return 0;
}

static void s32k3xx_clkout_config(const struct
                                  cgm_clkout_config_s *clkoutcfg)
{
  if (clkoutcfg->div == CGM_CLKOUT_DIV_DISABLE)
    {
      putreg32(0, S32K3XX_MC_CGM_MUX_6_DC_0);
    }
  else
    {
      putreg32((clkoutcfg->source << MC_CGM_MUX_CSS_SELSTAT_SHIFT),
                S32K3XX_MC_CGM_MUX_6_CSC);
      putreg32((MC_CGM_MUX_DC_DIV(clkoutcfg->div) | MC_CGM_MUX_DC_DE),
                S32K3XX_MC_CGM_MUX_6_DC_0);
    }
}

/****************************************************************************
 * Name: s32k1xx_scg_config
 *
 * Description:
 *   Configure CGM clocking.
 *
 * Input Parameters:
 *   cgmcfg - Describes the new CGM clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k3xx_cgm_config(const struct cgm_config_s *cgmcfg)
{
  int ret;

  /* Enable MSCM peripheral */

  s32k3xx_mscm_peripheral(true);

  /* Enable PLL peripheral */

  s32k3xx_pll_peripheral(true);

  /* Configure MC_CGM_MUX0 to run from FIRC clock to allow PLL reconfig. */

  putreg32((MC_CGM_MUX_0_DIV_TRIG_CTRL_TCTL |
            MC_CGM_MUX_0_DIV_TRIG_CTRL_HHEN),
              S32K3XX_MC_CGM_MUX_0_DIV_TRIG_CTRL);
  putreg32((MC_CGM_MUX_DC_DIV(0) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_0);
  putreg32((MC_CGM_MUX_DC_DIV(0) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_1);
  putreg32((MC_CGM_MUX_DC_DIV(2) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_2);
  putreg32((MC_CGM_MUX_DC_DIV(0) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_3);
  putreg32((MC_CGM_MUX_DC_DIV(0) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_4);
  putreg32((MC_CGM_MUX_DC_DIV(0) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_5);
  putreg32((MC_CGM_MUX_DC_DIV(0) | MC_CGM_MUX_DC_DE),
              S32K3XX_MC_CGM_MUX_0_DC_6);

  /* Transition to FIRC */

  ret = s32k3xx_mux_0_clocktransition();

  if (ret >= 0)
    {
      ret = s32k3xx_pll_config(&cgmcfg->pll);
    }

  if (ret >= 0)
    {
      ret = s32k3xx_scs_config(&cgmcfg->scs);
      if (ret >= 0)
        {
          /* Transition to PLL */

          ret = s32k3xx_mux_0_clocktransition();
        }
    }

  if (ret >= 0)
    {
      ret = s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_1_CSC);
    }

  if (ret >= 0)
    {
      ret = s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_3_CSC);
    }

  if (ret >= 0)
    {
      ret = s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_4_CSC);
    }

#ifdef CONFIG_S32K3XX_ENET
  if (ret >= 0)
    {
#  ifdef PIN_EMAC_MII_RMII_TX_CLK
    s32k3xx_pinconfig(PIN_EMAC_MII_RMII_TX_CLK);
#  endif
    ret = s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_7_CSC);
    ret = s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_8_CSC);
    ret = s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_9_CSC);
    }
#endif

#ifdef CONFIG_S32K3XX_QSPI
  if (ret >= 0)
    {
      s32k3xx_mux_x_clocktransition(S32K3XX_MC_CGM_MUX_10_CSC);
    }
#endif

  s32k3xx_clkout_config(&cgmcfg->clkout);

  return ret;
}

/****************************************************************************
 * Name: s32k3xx_clockconfig
 *
 * Description:
 *   Called to initialize the S32K3XX.  This does whatever setup is needed
 *   to put the MCU in a usable state.  This includes the initialization of
 *   clocking using the settings in board.h.  This function also performs
 *   other low-level chip as necessary.
 *
 * Input Parameters:
 *   clkcfg - Describes the new clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

int s32k3xx_clockconfig(const struct clock_configuration_s *clkcfg)
{
  int ret;

  ret = s32k3xx_cgm_config(&clkcfg->cgm);
  if (ret >= 0)
    {
        s32k3xx_periphclocks(num_of_peripheral_clocks_0, clkcfg->pcc.pclks);
    }

  return 0;
}

/****************************************************************************
 * Name: s32k3xx_get_freq
 *
 * Description:
 *    clock frequency from a clock source.
 *
 * Input Parameters:
 *   clksrc - The requested clock source.
 *
 * Returned Value:
 *   The frequency of the requested clock source.
 *
 ****************************************************************************/

uint32_t s32k3xx_get_freq(enum clock_names_e clksrc)
{
  uint32_t regval;

  switch (clksrc)
    {
      case CORE_CLK:
        {
          regval = getreg32(S32K3XX_MC_CGM_MUX_0_DC_0);
          if ((regval & MC_CGM_MUX_DC_DE) == 0)
            {
              return 0;
            }
          else
            {
              regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                        >> MC_CGM_MUX_DC_DIV_SHIFT);
              return s32k3xx_get_scsfreq() / (regval + 1);
            }
        }
        break;

      case SIRC_CLK:
          return s32k3xx_get_sircfreq();

      case FIRC_CLK:
          return s32k3xx_get_fircfreq();

      case AIPS_PLAT_CLK:
        {
          regval = getreg32(S32K3XX_MC_CGM_MUX_0_DC_1);
          if ((regval & MC_CGM_MUX_DC_DE) == 0)
            {
              return 0;
            }
          else
            {
              regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                        >> MC_CGM_MUX_DC_DIV_SHIFT);
              return s32k3xx_get_scsfreq() / (regval + 1);
            }
        }
        break;

