rtucker85/nuttx/arch/arm/src/s32k3xx/s32k3xx_clockconfig_orig.c
      case AIPS_SLOW_CLK:
        {
          regval = getreg32(S32K3XX_MC_CGM_MUX_0_DC_2);
          if ((regval & MC_CGM_MUX_DC_DE) == 0)
            {
              return 0;
            }
          else
            {
              regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                        >> MC_CGM_MUX_DC_DIV_SHIFT);
              return s32k3xx_get_scsfreq() / (regval + 1);
            }
        }
        break;

      case STM0_CLK:
        {
          regval = getreg32(S32K3XX_MC_CGM_MUX_1_DC_0);
          if ((regval & MC_CGM_MUX_DC_DE) == 0)
            {
              return 0;
            }
          else
            {
              switch (getreg32(S32K3XX_MC_CGM_MUX_1_CSC))
                {
                  case (CGM_CLK_SRC_AIPS_PLAT_CLK
                        << MC_CGM_MUX_CSS_SELSTAT_SHIFT):
                    regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                              >> MC_CGM_MUX_DC_DIV_SHIFT);
                    return s32k3xx_get_freq(AIPS_PLAT_CLK) / (regval + 1);

                  case (CGM_CLK_SRC_FXOSC << MC_CGM_MUX_CSS_SELSTAT_SHIFT):
                    regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                              >> MC_CGM_MUX_DC_DIV_SHIFT);
                    return s32k3xx_get_freq(FXOSC_CLK) / (regval + 1);

                  case (CGM_CLK_SRC_FIRC << MC_CGM_MUX_CSS_SELSTAT_SHIFT):
                    regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                              >> MC_CGM_MUX_DC_DIV_SHIFT);
                    return s32k3xx_get_freq(FIRC_CLK) / (regval + 1);

                  default:
                      return 0;
                }
            }
        }
        break;

      case FLEXCAN0_CLK:
      case FLEXCAN1_CLK:
      case FLEXCAN2_CLK:
        {
          regval = getreg32(S32K3XX_MC_CGM_MUX_3_DC_0);
          if ((regval & MC_CGM_MUX_DC_DE) == 0)
            {
              return 0;
            }
          else
            {
              regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                        >> MC_CGM_MUX_DC_DIV_SHIFT);
              return s32k3xx_get_freq(AIPS_PLAT_CLK) / (regval + 1);
            }
        }
        break;

      case FLEXCAN3_CLK:
      case FLEXCAN4_CLK:
      case FLEXCAN5_CLK:
        {
          regval = getreg32(S32K3XX_MC_CGM_MUX_4_DC_0);
          if ((regval & MC_CGM_MUX_DC_DE) == 0)
            {
              return 0;
            }
          else
            {
              regval = ((regval & MC_CGM_MUX_DC_DIV_MASK)
                        >> MC_CGM_MUX_DC_DIV_SHIFT);
              return s32k3xx_get_freq(AIPS_PLAT_CLK) / (regval + 1);
            }
        }
        break;

       default:
        {
          /* Invalid clock source type */

          DEBUGPANIC();
          return 0;
        }
        break;
    }
}

/****************************************************************************
 * Name: s32k3xx_get_coreclk
 *
 * Description:
 *   Return the current value of the CORE clock frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Values:
 *   The current value of the CORE clock frequency.  Zero is returned on any
 *   failure.
 *
 ****************************************************************************/

uint32_t s32k3xx_get_coreclk(void)
{
  return s32k3xx_get_freq(CORE_CLK);
}
